Test Run By ubuntu on Fri Apr 18 21:14:20 2014
Native configuration is x86_64-unknown-linux-gnu

		=== clic tests ===

Schedule of variations:
    unix

Running target unix
Using /usr/share/dejagnu/baseboards/unix.exp as board description file for target.
Using /usr/share/dejagnu/config/unix.exp as generic interface file for target.
WARNING: Couldn't find tool config file for unix, using default.
Running ./test/clic/test-ops.exp ...
spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> e
e 
2.718282PASS: e

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> PI
PI 
3.141593PASS: PI

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> y=2
2.000000 PASS: y=2

2.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1+2
1.000000 2.000000 + 
3.000000PASS: 1+2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (-1)+2
1.000000 neg 2.000000 + PASS: (-1)+2

1.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (-3)+-3
3.000000 neg 3.000000 neg + 
-6.000000PASS: (-3)+-3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1000000000000000000000 + 1000000000000000000000
1000000000000000000000.000000 1000000000000000000000.000000 + 
2000000000000000000000.000000PASS: 1000000000000000000000 + 1000000000000000000000

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1.2+3.3
1.200000 3.300000 + 
4.500000PASS: 1.2+3.3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1.2+3
1.200000 3.000000 + 
4.200000PASS: 1.2+3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 2-1
2.000000 1.000000 - PASS: 2-1

1.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1-3
1.000000 3.000000 - 
-2.000000PASS: 1-3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (-2)--2
2.000000 neg 2.000000 neg - 
0.000000PASS: (-2)--2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 2*2
2.000000 2.000000 * 
4.000000PASS: 2*2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 3*0
3.000000 0.000000 * PASS: 3*0

0.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (-2)*2
2.000000 neg 2.000000 * 
-4.000000PASS: (-2)*2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (-2)*-2
2.000000 neg 2.000000 neg * 
4.000000PASS: (-2)*-2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 6/3
6.000000 3.000000 / 
2.000000PASS: 6/3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 3/0
3.000000 0.000000 / 
infPASS: 3/0

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 0/2
0.000000 2.000000 / PASS: 0/2

0.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (-2)/3
2.000000 neg 3.000000 / 
-0.666667PASS: (-2)/3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 2^3
2.000000 3.000000 ^ 
8.000000PASS: 2^3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (2)^3
2.000000 3.000000 ^ 
8.000000PASS: (2)^3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (2^2)+3
2.000000 2.000000 ^ 3.000000 + 
7.000000PASS: (2^2)+3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (2)
2.000000 PASS: (2)

2.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (2+2)*3
2.000000 2.000000 + 3.000000 * 
12.000000PASS: (2+2)*3

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (3*(2-2)+(4/2))
3.000000 2.000000 2.000000 - * 4.000000 2.000000 / + PASS: (3*(2-2)+(4/2))

2.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1+(2*3)
1.000000 2.000000 3.000000 * + 
7.000000PASS: 1+(2*3)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1+(sqrt(4))
1.000000 4.000000 sqrt + 
3.000000PASS: 1+(sqrt(4))

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1+sqrt(4)
1.000000 4.000000 sqrt + 
3.000000PASS: 1+sqrt(4)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> neg(4)
4.000000 neg 
-4.000000PASS: neg(4)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> neg(-4)
4.000000 neg neg PASS: neg(-4)

4.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> sin(3)
3.000000 sin 
0.141120PASS: sin(3)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> cos(3)
3.000000 cos 
-0.989992PASS: cos(3)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> tg(4)
4.000000 tg 
1.157821PASS: tg(4)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> arcsin(1)
1.000000 arcsin 
1.570796PASS: arcsin(1)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> arcsin(5)
5.000000 arcsin 
nanPASS: arcsin(5)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> arccos(-1)
1.000000 neg arccos 
3.141593PASS: arccos(-1)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> arctg(1)
1.000000 arctg 
0.785398PASS: arctg(1)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> exp(2)
2.000000 exp 
7.389056PASS: exp(2)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> ln(2)
2.000000 ln 
0.693147PASS: ln(2)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> ln(0)
0.000000 ln 
-infPASS: ln(0)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> lg(3)
3.000000 lg 
0.477121PASS: lg(3)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> sqrt(4)
4.000000 sqrt 
2.000000PASS: sqrt(4)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> sqrt(-2)
2.000000 neg sqrt 
-nanPASS: sqrt(-2)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> sqrt(5)
5.000000 sqrt 
2.236068PASS: sqrt(5)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> cbrt(8)
8.000000 cbrt 
2.000000PASS: cbrt(8)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> sh(4)
4.000000 sh 
27.289917PASS: sh(4)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> ch(4)
4.000000 ch 
27.308233PASS: ch(4)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> th(4)
4.000000 th 
0.999329PASS: th(4)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> erf(2)
2.000000 erf 
0.995322PASS: erf(2)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> erfc(2)
2.000000 erfc 
0.004678PASS: erfc(2)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> G(3)
3.000000 G 
2.000000PASS: G(3)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> (2
---syntax errorPASS: (2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> tan(2)
---unknown identifierPASS: tan(2)

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> \h
\v - variable list
\f - function list
\q - quitPASS: \h

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> \v
e = 2.718282 (readonly)PASS: \v

PI = 3.141593 (readonly)
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> PASS: \f
\f
+
-
*
/
^
(
)
neg
nul
sin
cos
tg
arcsin
arccos
arctg
exp
ln
lg
sqrt
cbrt
sh
ch
th
erf
erfc
G
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> PASS: \c
\c
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> \g
---unknown commandPASS: \g

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> PASS: 

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1==2
---more than one '='PASS: 1==2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1=2
2.000000 
---invalid variable or function namePASS: 1=2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> a=2
2.000000 PASS: a=2

2.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> a=1
1.000000 PASS: a=1b=a

1.000000
clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> e=1
1.000000 
---you can not change the valuePASS: e=1

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> PI=2
2.000000 
---you can not change the valuePASS: PI=2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> sqrt=2
2.000000 
---name conflictPASS: sqrt=2

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 12ee=1
1.000000 
---invalid variable or function namePASS: 12ee=1

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> a-1=1
1.000000 
---invalid variable or function namePASS: a-1=1

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> ©=1
1.000000 
---invalid variable or function namePASS: ©=1

clic2> spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> + 2 2
22.000000 nul 
22.000000
clic2> FAIL: + 2 2
spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> eiwfbiaewubfwebfeafieuwbfiuwaebfieuwabfiuewabioebebfjkhfdisfosdifhodsfhapdhopwefawb feufawfbweaubfeiwpaubfiawpubipuewabfipeubfuebwiuewabfipebiepubfpiuewbfpiuewbfpiuebfipuebfa ipwubfpiuaebfipwaubfipuewabfipuabfiaweubfpiewaubfpawiuebfipwauebfpeiuwbfapiwuebfipwaubfpaw ubfpewabfpeiwaubfwaebfpieauwbfipuewabfipeuwabfwe=1
---identifier is too long
clic2> PASS: eiwfbiaewubfwebfeafieuwbfiuwaebfieuwabfiuewabioebebfjkhfdisfosdifhodsfhapdhopwefawbfeufawfbweaubfeiwpaubfiawpubipuewabfipeubfuebwiuewabfipebiepubfpiuewbfpiuewbfpiuebfipuebfaipwubfpiuaebfipwaubfipuewabfipuabfiaweubfpiewaubfpawiuebfipwauebfpeiuwbfapiwuebfipwaubfpawubfpewabfpeiwaubfwaebfpieauwbfipuewabfipeuwabfwe=1
spawn /home/ubuntu/PortlandState/spring2014/softwareTesting/project1/project/clic-2/clic
Type '\h' to get some help
clic2> 1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3 +4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6 +1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6
1.000000 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 1.000000 + 2.000000 + 3.000000 + 4.000000 + 5.000000 + 6.000000 + 
FAIL: 1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6+1+2+3+4+5+6
ERROR: tcl error sourcing ./test/clic/test-ops.exp.
ERROR: expect: spawn id exp80 not open
    while executing
"expect "clic2>" { send "\\q\r"}"
    ("foreach" body line 14)
    invoked from within
"foreach pattern $testdata {
  set inputs [lindex $pattern 0]
  append inputs "\r"
  spawn $CLIC
  expect "clic2>" { send "$inputs"}

  expect {
    -r..."
    (file "./test/clic/test-ops.exp" line 95)
    invoked from within
"source ./test/clic/test-ops.exp"
    ("uplevel" body line 1)
    invoked from within
"uplevel #0 source ./test/clic/test-ops.exp"
    invoked from within
"catch "uplevel #0 source $test_file_name""
testcase ./test/clic/test-ops.exp completed in 12 seconds

		=== clic Summary ===

# of expected passes		71
# of unexpected failures	2
runtest completed at Fri Apr 18 21:14:32 2014
